jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_slave/src/fsl_dspi_slave_driver_dma_support.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <string.h>
#include <assert.h>
#include "fsl_dspi_common.h"
#include "fsl_dspi_slave_driver.h"
#include "fsl_dspi_shared_function.h"
#include "fsl_clock_manager.h"
#include "fsl_interrupt_manager.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! SPI slave constants */
enum _spi_slave_constants
{
    kEmptyChar = 0,                        /*!< Empty character */
};

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
typedef void (*dspiSlaveDone)(void);

void DSPI_DRV_SlaveDmaCallback(void *param, edma_chn_status_t chanStatus);

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveDmaCallback
 * Description   : This function is called when the eDMA generates an interrupt.
 * The eDMA generates an interrupt when the channel is "done", meaning that the
 * expected number of bytes have been transferred.  When the interrupt occurs,
 * the eDMA will jump to this callback as it was registered in the eDMA register
 * callback service function.  The user will defined their own callback function
 * to take whatever action they deem necessary for handling the end of a transfer.
 * For example, the user may simply want their callback function to set a global
 * flag to indicate that the transfer is complete.  The user defined callback
 * is passed in through the "param" parameter.
 * The parameter chanStatus is currently not used.
 *
 *END**************************************************************************/
void DSPI_DRV_SlaveDmaCallback(void *param, edma_chn_status_t chanStatus)
{
    dspiSlaveDone doneFunction;

    /* Due to MISRA 11.1 rule:
     * Conversions shall not be performed between a pointer to a function
     * and any type other than an integral type.
     * We first have to typecast "param" as a uint32_t before typecasting as
     * a void function pointer.
     */
    uint32_t paramAsInt = (uint32_t)(param);

    if (param != NULL)
    {
        /* Define "doneFunction" as a pointer to the user defined callback function passed
         * in through the parameter "param".  Because param is a void pointer, we need to
         * typecast it as a function pointer.  The typedef definition of the function pointer
         * is defined previously as "typedef void (*dspiSlaveDone)(void);"
         * However, becasue of MISRA 11.1, we had to typecast param as an integral so that it
         * is re-named paramAsInt
         */
        doneFunction = (dspiSlaveDone)(paramAsInt);
        doneFunction(); /* Jump to the user defined callback function */
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_SlaveInitDma
 * Description   : Initialize a DSPI instance for slave mode operation with DMA support.
 * This function is exactly like the DSPI_DRV_SlaveInit function but in addition, adds DMA support.
 * This function saves the callbacks to the run-time state structure for later use in the
 * interrupt handler. However, unlike the CPU driven slave driver, there is no need to define
 * callbacks for the data sink or data source since the user will simply pass in buffers
 * for the send and receive data, and the DMA engine will use those buffers.
 * An onError callback is needed to service potential errors seen during a TX FIFO underflow or
 * RX FIFO overflow.
 * The user also passes in a user defined callback for handling end of transfers (dspiDone).
 * These callbacks are set in the dspi_slave_callbacks_t structure which is part of the
 * dspi_slave_user_config_t structure.  See example below.
 * This function also ungates the clock to the DSPI module, initializes the DSPI
 * for slave mode, enables the module and corresponding interrupts and sets up the DMA channels.
 * Once initialized, the DSPI module is configured in slave mode and ready to receive data from a
 * SPI master. The following is an example of how to set up the dspi_slave_state_t and the
 * dspi_slave_user_config_t parameters and how to call the DSPI_DRV_SlaveInit function by passing
 * in these parameters:
 *   instance = slaveInstance; <- the desired module instance number
 *   dspi_slave_state_t dspiSlaveState; <- the user simply allocates memory for this struct
 *   dspi_slave_user_config_t slaveUserConfig;
 *   slaveUserConfig.callbacks.onError = on_error; <- set to user implementation of function
 *   slaveUserConfig.callbacks.dspiDone = dspi_Dma_Done; <- user defined callback
 *   slaveUserConfig.dataConfig.bitsPerFrame = 16; <- example, can be 4 to 32
 *   slaveUserConfig.dataConfig.clkPhase = kDspiClockPhase_FirstEdge; <- example setting
 *   slaveUserConfig.dataConfig.clkPolarity = kDspiClockPolarity_ActiveHigh; <- example setting
 *   sendBuffer <- (pointer) to the source data buffer, can be NULL
 *   receiveBuffer <- (pointer) to the receive data buffer, can be NULL
 *   transferCount <- number of bytes to transfer
 *
 *   DSPI_DRV_SlaveInitDma(slaveInstance, &slaveUserConfig, &dspiSlaveState,
 *                         &sendBuffer, &receiveBuffer, transferCount);
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_SlaveInitDma(uint32_t instance,
                                  dspi_slave_state_t * dspiState,
                                  const dspi_slave_user_config_t * slaveConfig,
                                  const uint8_t * sendBuffer,
                                  uint8_t * receiveBuffer,
                                  size_t transferByteCount)
{
    assert(slaveConfig);
    assert(instance < HW_SPI_INSTANCE_COUNT);

