jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_slave/src/fsl_dspi_slave_driver_dma_support.c
    uint32_t dmaInstance, dmaChannel; /* For temporarily storing DMA instance and channel */
    uint32_t majorIteration; /* Number of major iteration loop count used by the eDMA */
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    dspi_status_t errorCode = kStatus_DSPI_Success;

    /* Clear the run-time state struct for this instance. */
    memset(dspiState, 0, sizeof(* dspiState));

    /* Save the application info. */
    dspiState->callbacks = slaveConfig->callbacks;

    /* configure the run-time state struct with the number of bits/frame */
    dspiState->bitsPerFrame = slaveConfig->dataConfig.bitsPerFrame;

    /* Set the DSPI run-time state struct flag to indicate it will use the DMA */
    dspiState->useDma = true;

    /* Enable clock for DSPI */
    CLOCK_SYS_EnableSpiClock(instance);

    /* Reset the DSPI module, which also disables the DSPI module */
    DSPI_HAL_Init(baseAddr);

    /* Set to slave mode.*/
    DSPI_HAL_SetMasterSlaveMode(baseAddr, kDspiSlave);

    errorCode = DSPI_HAL_SetDataFormat(baseAddr, kDspiCtar0, &slaveConfig->dataConfig);

    /* Enable fifo operation (regardless of FIFO depth) */
    DSPI_HAL_SetFifoCmd(baseAddr, true, true);

    /* DSPI system enable */
    DSPI_HAL_Enable(baseAddr);

    /* flush the fifos*/
    DSPI_HAL_SetFlushFifoCmd(baseAddr, true, true);

    /* Configure IRQ state structure, so irq handler can point to the correct state structure */
    g_dspiStatePtr[instance] = dspiState;

    /*************************************************************************
     * Set up DMA channel for RX FIFO only if user passes in a receive buffer
     *************************************************************************/
    if (receiveBuffer)
    {
        /***********************************
         * Request DMA channels for RX FIFO
         * This channel transfers data from RX FIFO to receiveBuffer
         ***********************************/
        /* Request channel for receive */
        EDMA_DRV_RequestChannel(kEDMAAnyChannel, kDmaRequestMux0SPI0Rx,
                                &dspiState->dmaRxFifo2RxBuff);

        /* Set up Transfer Control Descriptor for RX DMA channel */
        /* For each transfer control descriptor set up, save off DMA instance and channel number
         * to simplified variable names to make code cleaner
         */
        dmaInstance = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->dmaRxFifo2RxBuff.channel);
        dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->dmaRxFifo2RxBuff.channel);

        /* Source addr, RX FIFO */
        EDMA_HAL_HTCDSetSrcAddr(dmaInstance, dmaChannel,
                                HW_SPI_POPR_ADDR(baseAddr));

        /* Source addr offset is 0 as source addr never increments */
        EDMA_HAL_HTCDSetSrcOffset(dmaInstance, dmaChannel, 0);

        /* Source address adjust last: don't increment source address, it is constant */
        EDMA_HAL_HTCDSetSrcLastAdjust(dmaInstance, dmaChannel, 0);

        /* Destination is the receive buffer */
        EDMA_HAL_HTCDSetDestAddr(dmaInstance, dmaChannel, (uint32_t)(receiveBuffer));

        /* Dest addr offset, always increment to the next byte */
        EDMA_HAL_HTCDSetDestOffset(dmaInstance, dmaChannel, 1);

        /* No adjustment needed for destination addr for most bits/frame. This field gets
         * updated for the special case of 24-bits/frame
         */
        EDMA_HAL_HTCDSetDestLastAdjust(dmaInstance, dmaChannel, 0);

        /* The source and destination attributes (bit size) depends on bits/frame setting */
        if (dspiState->bitsPerFrame <= 8)
        {
            /* Destination size is always one byte, source size varies depending on bits/frame */
            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                    kEDMAModuloDisable, kEDMAModuloDisable,
                    kEDMATransferSize_1Bytes, kEDMATransferSize_1Bytes);

            /* Transfer 1 byte from RX FIFO to receive buffer */
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 1);

            /* Adjust majorIteration to 1 byte per transfer */
            majorIteration = transferByteCount;
        }
        else if (dspiState->bitsPerFrame <= 16)
        {
            /* Source size is two bytes */
            /* Destination size is always one byte, source size varies depending on bits/frame */
            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                    kEDMAModuloDisable, kEDMAModuloDisable,
                    kEDMATransferSize_2Bytes, kEDMATransferSize_1Bytes);


            /* Transfer 2 bytes from RX FIFO to receive buffer */
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 2);

            /* Adjust majorIteration to 2 bytes per transfer */
            majorIteration = transferByteCount/2;
        }
/* For now, we will limit the user to use 1-, 2-, or 4-byte transfers. This implementation
 * of 3-byte transfers changes the eDMA overall operation to enable minorloop mapping which may
 * be undesireable to other drivers. For future implmentations, we will look into setting up
 * three linked channels: 1 channel to transfer a word from the RX FIFO to an intermediate buffer
 * another channel to transfer 2 bytes from the intermediate buffer to the recevie buffer and
 * finally another channel to transfer the last byte from the intermediate buffer to the
 * receive buffer
 */
#if 0
        else if (dspiState->bitsPerFrame <= 24)
        {
            /* Source size is actually 3 bytes (for up to 24-bits/frame), but we only have the
             * option to go up to a 4 byte (32-bit) source size, as 3 bytes is not a supported
             * setting.  That means we are always forced to transfer 4 bytes instead of the
             * desired 3 bytes. Later, we'll adjust the destination address to "go back one byte"
             * by using the minor loop offset feature of the eDMA. Note, source = RX FIFO and
             * destination = receive buffer.
             */
            edma_hal_htcd_configure_source_transfersize(dmaInstance, dmaChannel,
                                                        kEdmaTransferSize4bytes);
            /* Enable minor loop mapping CR[EMLM]=1 which enables the minor loop offset feature */
            edma_hal_set_minor_loop_mapping(dmaInstance, true);

            /* Set the destination minor loop offset enable and set the offset MLOFF to -1
             * As stated previously, we need the destination address to "go back one byte"
             * at the end of the minor loop transfer of 4 bytes.
             */
            edma_minorloop_offset_config_t minorLoopConfig;
            minorLoopConfig.isEnableDestMinorloop = true;
            minorLoopConfig.isEnableSourceMinorloop = false;
            minorLoopConfig.offset = -1;
            edma_hal_htcd_configure_minorloop_offset(dmaInstance, dmaChannel, minorLoopConfig);

            /* Set the minor loop transfer size to 4 bytes to align with the source size of
             * 4 bytes. Basically we are reading 4 bytes from the FIFO and writing to the
             * receive buffer.
             */
            edma_hal_htcd_configure_nbytes_minorloop_enabled_offset_enabled(dmaInstance,
                                                                            dmaChannel, 4);

            /* Adjust majorIteration to 3 bytes per transfer */
            majorIteration = transferByteCount/3;
        }
#endif
        else
        {
            /* Source size 4 bytes (32-bit) */
            /* Destination size is always one byte, source size varies depending on bits/frame */
            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                    kEDMAModuloDisable, kEDMAModuloDisable,
                    kEDMATransferSize_4Bytes, kEDMATransferSize_1Bytes);

