jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_slave/src/fsl_dspi_slave_driver_dma_support.c
            /* Transfer 4 bytes from RX FIFO to receive buffer */
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 4);

            /* Adjust majorIteration to 4 bytes per transfer */
            majorIteration = transferByteCount/4;
        }

        /* Configure CITER and BITER fields and clear the ELINK field (disable channel linking) */
        EDMA_HAL_HTCDSetChannelMinorLink(dmaInstance, dmaChannel, 0, false);
        EDMA_HAL_HTCDSetMajorCount(dmaInstance, dmaChannel, majorIteration);

        /* Now that the TCD was set up, enable the DSPI Peripheral Hardware request for the
         * RX FIFO
         */
        EDMA_HAL_SetDmaRequestCmd(dmaInstance, (edma_channel_indicator_t)dmaChannel, true);

        /* Enable the Receive FIFO Drain Request as a DMA request */
        DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateDmaReq, true);

        /* RX FIFO overflow request enable (to interrupt on RX errors) */
        DSPI_HAL_SetIntMode(baseAddr, kDspiRxFifoOverflow, true);

        /* Set up eDMA interrupt handler */
        /* Due to MISRA 11.1 rule:
         * Conversions shall not be performed between a pointer to a function
         * and any type other than an integral type.
         * We first have to typecast the callback function pointer as a uint32_t before typecasting
         * as a void pointer.
         */
        uint32_t userCallbackInt = (uint32_t)(slaveConfig->callbacks.dspiDone);
        EDMA_DRV_InstallCallback(
            &dspiState->dmaRxFifo2RxBuff, DSPI_DRV_SlaveDmaCallback,(void *)(userCallbackInt));

        /* The number of bytes to transfer was configured above as the eDMA
         * major loop iteration count.  When this counts down to 0, it indicates
         * that the channel is done. Enable this channel done interrupt in the
         * eDMA CSR.  The ISR is defined in the eDMA driver with a callback registered
         * above.  This is eventually called back to the user defined callback.
         */
        EDMA_HAL_HTCDSetIntCmd(dmaInstance, dmaChannel, true);
    }

    /*************************************************************************
     * Set up DMA channel for TX FIFO only if user passes in a send buffer
     *************************************************************************/
    if (sendBuffer)
    {
        /***********************************
         * Request DMA channels for TX FIFO
         * This channel transfers data from source buffer to TX FIFO (PUSHR).
         ***********************************/
        /* Request channel for transmit */
        EDMA_DRV_RequestChannel(kEDMAAnyChannel, kDmaRequestMux0SPI0Tx, &dspiState->dmaSrc2TxFifo);

        /* Set up Transfer Control Descriptor for TX DMA channel */
        /* For each transfer control descriptor set up, save off DMA instance and channel number
         * to simplified variable names to make code cleaner
         */
        dmaInstance = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->dmaSrc2TxFifo.channel);
        dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->dmaSrc2TxFifo.channel);

        /* Source addr, TX Send buffer */
        EDMA_HAL_HTCDSetSrcAddr(dmaInstance, dmaChannel,(uint32_t)(sendBuffer));

        /* Source addr offset is 1 as send buffer pointer is incremented 1 bytes for each write */
        EDMA_HAL_HTCDSetSrcOffset(dmaInstance, dmaChannel, 1);

        /* Source address adjust last: don't increment source address */
        EDMA_HAL_HTCDSetSrcLastAdjust(dmaInstance, dmaChannel, 0);


        /* Destination is the TX FIFO */
        EDMA_HAL_HTCDSetDestAddr(dmaInstance, dmaChannel,
                                 HW_SPI_PUSHR_SLAVE_ADDR(baseAddr));

        /* Dest addr offset don't increment as it is a FIFO */
        EDMA_HAL_HTCDSetDestOffset(dmaInstance, dmaChannel, 0);

        /* No adjustment needed for destination addr */
        EDMA_HAL_HTCDSetDestLastAdjust(dmaInstance, dmaChannel, 0);

        /* The source and destination attributes (bit size) depends on bits/frame setting */
        if (dspiState->bitsPerFrame <= 8)
        {
            /* Destination size is one byte */
            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                    kEDMAModuloDisable, kEDMAModuloDisable,
                    kEDMATransferSize_1Bytes, kEDMATransferSize_1Bytes);

            /* Transfer 1 byte from send buffer to TX FIFO  */
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 1);

            /* Adjust majorIteration to 1 byte per transfer */
            majorIteration = transferByteCount;
        }
        else if (dspiState->bitsPerFrame <= 16)
        {
            /* Destination size is two bytes */
            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                    kEDMAModuloDisable, kEDMAModuloDisable,
                    kEDMATransferSize_1Bytes, kEDMATransferSize_2Bytes);

            /* Transfer 2 bytes from send buffer to TX FIFO */
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 2);

            /* Adjust majorIteration to 2 bytes per transfer */
            majorIteration = transferByteCount/2;
        }
/* For now, we will limit the user to use 1-, 2-, or 4-byte transfers. This implementation
 * of 3-byte transfers changes the eDMA overall operation to enable minorloop mapping which may
 * be undesireable to other drivers. For future implmentations, we will look into setting up
 * three linked channels: 1 channel to transfer 2 bytes to an intermediate buffer, another channel
 * to transfer one byte to the intermediate buffer, and finally another channel to transfer the
 * intermediate buffer to the TX FIFO
 */
#if 0
        else if (dspiState->bitsPerFrame <= 24)
        {
            /* Destination size is actually 3 bytes (for up to 24-bits/frame), but we only have the
             * option to go up to a 4 byte (32-bit) destination size, as 3 bytes is not a supported
             * setting.  That means we are always forced to transfer 4 bytes instead of the
             * desired 3 bytes. Later, we'll adjust the source address to "go back one byte"
             * by using the minor loop offset feature of the eDMA. Note, source = source buffer
             * destination = TX FIFO.
             */
              edma_hal_htcd_configure_dest_transfersize(dmaInstance, dmaChannel,
                                                      kEdmaTransferSize4bytes);

            /* Enable minor loop mapping CR[EMLM]=1 which enables the minor loop offset feature */
            edma_hal_set_minor_loop_mapping(dmaInstance, true);

            /* Set the source minor loop offset enable and set the offset MLOFF to -1
             * As stated previously, we need the source address to "go back one byte"
             * at the end of the minor loop transfer of 4 bytes.
             */
            edma_minorloop_offset_config_t minorLoopConfig;
            minorLoopConfig.isEnableDestMinorloop = false;
            minorLoopConfig.isEnableSourceMinorloop = true;
            minorLoopConfig.offset = -1;
            edma_hal_htcd_configure_minorloop_offset(dmaInstance, dmaChannel, minorLoopConfig);

