jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_slave/src/fsl_dspi_slave_driver_dma_support.c
            /* Set the minor loop transfer size to 4 bytes to align with the destination size of
             * 4 bytes. Basically we are reading 4 bytes from the source buffer and writing to
             * TX FIFO.
             */
            edma_hal_htcd_configure_nbytes_minorloop_enabled_offset_enabled(dmaInstance,
                                                                            dmaChannel, 4);

            /* Adjust majorIteration to 3 bytes per transfer */
            majorIteration = transferByteCount/3;
        }
#endif
        else
        {
            /* Destination size 4 bytes (32-bit) */
            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                    kEDMAModuloDisable, kEDMAModuloDisable,
                    kEDMATransferSize_1Bytes, kEDMATransferSize_4Bytes);

            /* Transfer 4 bytes from RX FIFO to receive buffer */
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 4);

            /* Adjust majorIteration to 4 bytes per transfer */
            majorIteration = transferByteCount/4;
        }

        /* Configure CITER and BITER fields and clear the ELINK field (disable channel linking) */
        EDMA_HAL_HTCDSetChannelMinorLink(dmaInstance, dmaChannel,0,false);
        EDMA_HAL_HTCDSetMajorCount(dmaInstance, dmaChannel, majorIteration);

        /* Now that the TCD was set up, enable the DSPI Peripheral Hardware request for the
         * TX FIFO.
         */
        EDMA_HAL_SetDmaRequestCmd(dmaInstance, (edma_channel_indicator_t)dmaChannel, true);

        /* Enable the TX FIFO Fill Request as a DMA request */
        DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateDmaReq, true);

        /* Set up eDMA interrupt handler only if it hasn't already been defined for receive */
        if (receiveBuffer == NULL)
        {
            /* Set up eDMA interrupt handler */
            /* Due to MISRA 11.1 rule:
             * Conversions shall not be performed between a pointer to a function
             * and any type other than an integral type.
             * We first have to typecast the callback function pointer as a uint32_t before
             * typecasting as a void pointer.
             */
            uint32_t userCallbackInt = (uint32_t)(slaveConfig->callbacks.dspiDone);
            EDMA_DRV_InstallCallback(&dspiState->dmaSrc2TxFifo, DSPI_DRV_SlaveDmaCallback,
                                   (void *)(userCallbackInt));

            /* The number of bytes to transfer was configured above as the eDMA
             * major loop iteration count.  When this counts down to 0, it indicates
             * that the channel is done. Enable this channel done interrupt in the
             * eDMA CSR.  The ISR is defined in the eDMA driver with a callback registered
             * above.  This is eventually called back to the user defined callback.
             */
            EDMA_HAL_HTCDSetIntCmd(dmaInstance, dmaChannel, true);
        }

        /* TX FIFO underflow request enable*/
        DSPI_HAL_SetIntMode(baseAddr, kDspiTxFifoUnderflow, true);
    }
    else
    {
        /* Write known data (zeros) if no source buffer passed in */
        DSPI_HAL_WriteDataSlavemode(baseAddr, kEmptyChar);
    }

    /* Start DSPI transfers, set to running state */
    DSPI_HAL_StartTransfer(baseAddr);

    /* Interrupts are used in this driver for detecting following DSPI error conditions:
     * TX Underflow
     * RX Overflow
     * User must define an error handler for these interrupts (refer to DSPI_DRV_SlaveInitDma
     * comments for more details).
     */
    /* Enable the interrupt */
    INT_SYS_EnableIRQ(g_dspiIrqId[instance]);

    return errorCode;
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

